// int location
void routes(){
  server.on("/js", handleJSCode);
  server.on("/css", handleCSSAll);
  server.on("/", [](){handleMain("Поздравляю, у тебя получилось подключиться и мы готовы начинать. Иди на открытую веранду и поиграй в дартс. В каждом шарике есть код, который приведет тебя в некоторые локации. Всего есть 2 вида локаций: локации-ловушки и локации-призы. Ловушки будут замедлять общий ход игры. Проходить можно только одну локацию за раз, пропускать локации нельзя. Желаю дойти до конци и повеселиться. С днем рождения!");});
  
  // Локация 01 Второй этаж
  server.on("/79801", [](){handleParts("Второй этаж", "Дмитрий Донской",                     "65701");});
  server.on("/65701", [](){handleParts("Второй этаж", "Федеральный справочник",              "45401");});
  server.on("/45401", [](){handleParts("Второй этаж", "Выключатели нужны чтоб включать?",    "22701");});
  server.on("/22701", [](){handleParts("Второй этаж", "А если не включается если включать?", "37601");});
  server.on("/37601", [](){handleParts("Второй этаж", "Кря кря)",                            "73301");});
  server.on("/73301", [](){handleParts("Второй этаж", "Машина",                              "75101");});
  server.on("/75101", [](){handleParts("Второй этаж", "Уши бывают правые и... не только",    "11701");});
  server.on("/11701", [](){handleMain("Ну вот и этот этап пройден, как тебе лампа?)");});

  // Локация 02 Первый этаж
  server.on("/75502", [](){handleParts("Первый этаж", "Мат",                                          "51102");});
  server.on("/51102", [](){handleParts("Первый этаж", "Всегда с кухни надо бежать",                   "61702");});
  server.on("/61702", [](){handleParts("Первый этаж", "Когда настолько горячо, что больше некуда",    "55802");});
  server.on("/55802", [](){handleParts("Первый этаж", "Надо бы в машину положить...",                 "49502");});
  server.on("/49502", [](){handleParts("Первый этаж", "Чтоб ножкам тепло было есть целый шкаф",       "76502");});
  server.on("/76502", [](){handleParts("Первый этаж", "Пух, Винни Пух",                               "39202");});
  server.on("/39202", [](){handleParts("Первый этаж", "Когда ты уже сделаешь котенку домик?",         "50902");});
  server.on("/50902", [](){handleParts("Первый этаж", "Надпись",                                      "61602");});
  server.on("/61602", [](){handleParts("Первый этаж", "Сокол",                                        "32702");});
  server.on("/32702", [](){handleParts("Первый этаж", "Красная площадь",                              "78502");});
  server.on("/78502", [](){handleParts("Первый этаж", "Якорь",                                        "85502");});
  server.on("/85502", [](){handleParts("Первый этаж", "На кого работаешь?",                           "87502");});
  server.on("/87502", [](){handleParts("Первый этаж", "ААА это паук",                                 "43702");});
  server.on("/43702", [](){handleParts("Первый этаж", "А есть ли в доме погреб?",                     "56402");});
  server.on("/56402", [](){handleMain("Батарейки, серьезно? Еще бы каплю для воды подарил... Хм, а это идея)");});

  // Локация 03 Кухня старая
  server.on("/42403", [](){handleParts("Кухня старая", "Корабль",                                 "81303");});
  server.on("/81303", [](){handleParts("Кухня старая", "10 литров... Маловато будет",             "50203");});
  server.on("/50203", [](){handleParts("Кухня старая", "Куча точек",                              "78603");});
  server.on("/78603", [](){handleParts("Кухня старая", "Ой, горячо!",                             "10103");});
  server.on("/10103", [](){handleParts("Кухня старая", "Юма там отметился (хоть и не сам)",       "22103");});
  server.on("/22103", [](){handleParts("Кухня старая", "Как называют карлика который волнуется?", "73003");});
  server.on("/73003", [](){handleParts("Кухня старая", "Давай искать чай?",                       "94903");});
  server.on("/94903", [](){handleMain("Как тебе книга? То, что хотела?)");});

  // Локация 04 Старый огород
  server.on("/46704", [](){handleParts("Старый огород", "Шашлычки",                "66004");});
  server.on("/66004", [](){handleParts("Старый огород", "Флоксы",                  "35004");});
  server.on("/35004", [](){handleParts("Старый огород", "Не кошачья но все же",    "98004");});
  server.on("/98004", [](){handleParts("Старый огород", "Грыжа, но не Г",          "70004");});
  server.on("/70004", [](){handleParts("Старый огород", "Георгины",                "25704");});
  server.on("/25704", [](){handleParts("Старый огород", "Астра",                   "90304");});
  server.on("/90304", [](){handleParts("Старый огород", "Вишня",                   "76304");});
  server.on("/76304", [](){handleParts("Старый огород", "Слива",                   "98504");});
  server.on("/98504", [](){handleParts("Старый огород", "Ирга",                    "24204");});
  server.on("/24204", [](){handleMain("Проводок... Интересно зачем?");});

  // Локация 05 Новый огород
  server.on("/20105", [](){handleParts("Новый огород", "Яблоня",                  "92305");});
  server.on("/92305", [](){handleParts("Новый огород", "Флоксы",                  "35605");});
  server.on("/35605", [](){handleParts("Новый огород", "Желтые ромашки",          "36905");});
  server.on("/36905", [](){handleParts("Новый огород", "Слива",                   "67605");});
  server.on("/67605", [](){handleParts("Новый огород", "Бочка",                   "43505");});
  server.on("/43505", [](){handleParts("Новый огород", "Черноплодная рябина",     "61905");});
  server.on("/61905", [](){handleParts("Новый огород", "Черненькая такая",        "86805");});
  server.on("/86805", [](){handleMain("О, книга, кто знает, может соберем все 3?");});

  // Локация 06 Баня
  server.on("/57206", [](){handleParts("Баня", "Лопата зимняя",                                           "25706");});
  server.on("/25706", [](){handleParts("Баня", "Белая широкая доска",                                     "61406");});
  server.on("/61406", [](){handleParts("Баня", "Маска",                                                   "49006");});
  server.on("/49006", [](){handleParts("Баня", "Вывеска",                                                 "81306");});
  server.on("/81306", [](){handleParts("Баня", "Косилка",                                                 "46406");});
  server.on("/46406", [](){handleParts("Баня", "Осторожно!",                                              "25606");});
  server.on("/25606", [](){handleParts("Баня", "У каждого русского обязано быть это домашнее животное",   "95506");});
  server.on("/95506", [](){handleParts("Баня", "Ох уж эти самокатчики, не то что мы",                     "24606");});
  server.on("/24606", [](){handleParts("Баня", "За дверью что-то есть",                                   "26006");});
  server.on("/26006", [](){handleParts("Баня", "Конец жизненного цикла дерева",                           "47206");});
  server.on("/47206", [](){handleMain("Блок питания... Интересно зачем?");});

  // Локация 07 Душ
  server.on("/25607", [](){handleParts("Душ", "Мда, еще не помылись а воды уже нет",              "12507");});
  server.on("/12507", [](){handleParts("Душ", "Зачем она тут стоит? На ней же никто не сидит",    "13307");});
  server.on("/13307", [](){handleParts("Душ", "Что электроинструмент делает в месте с водой?",    "30907");});
  server.on("/30907", [](){handleParts("Душ", "Ты",                                               "26407");});
  server.on("/26407", [](){handleParts("Душ", "Надо не забыть взять на отдых",                    "68507");});
  server.on("/68507", [](){handleParts("Душ", "Туалет в ванне, 2 в одном?",                       "46407");});
  server.on("/46407", [](){handleParts("Душ", "Это для рук, это для лица, а это для чего?",       "59807");});
  server.on("/59807", [](){handleParts("Душ", "Открыть",                                          "92307");});
  server.on("/92307", [](){handleParts("Душ", "Открыть",                                          "34807");});
  server.on("/34807", [](){handleMain("Вау! Это же книга Марининой, тебе именно ее не хватало в коллекции?");});
  
  // Локация 08 Сарай
  server.on("/19208", [](){handleParts("Сарай", "Пила(много?)",           "85308");});
  server.on("/85308", [](){handleParts("Сарай", "Масло",                  "78008");});
  server.on("/78008", [](){handleParts("Сарай", "Гвозди",                 "48608");});
  server.on("/48608", [](){handleParts("Сарай", "Треугольная деревяшка",  "61308");});
  server.on("/61308", [](){handleParts("Сарай", "Шкатулка серая",         "62408");});
  server.on("/62408", [](){handleParts("Сарай", "Летнее универсальное",   "32708");});
  server.on("/32708", [](){handleParts("Сарай", "Красная сумка",          "90208");});
  server.on("/90208", [](){handleMain("Подарка нет, но есть задание: сходить прогуляться по малому кругу. Пока задание не выполнено выбирать новые локации нельзя.");});

  // Локация 09 Теплица
  server.on("/23709", [](){handleParts("Теплица", "Встречают с...",                    "22709");});
  server.on("/22709", [](){handleParts("Теплица", "Найди цветок",                      "66409");});
  server.on("/66409", [](){handleParts("Теплица", "Брус",                              "84409");});
  server.on("/84409", [](){handleParts("Теплица", "Поищи в бочке рядом с локацией",    "53709");});
  server.on("/53709", [](){handleMain("Бутылочка колы не повредит");});

  // Локация 10 Машина
  server.on("/18610", [](){handleParts("Машина", "Заведи",                                  "31010");});
  server.on("/31010", [](){handleParts("Машина", "Видеорегистратор",                        "17610");});
  server.on("/17610", [](){handleParts("Машина", "Мусор",                                   "70710");});
  server.on("/70710", [](){handleParts("Машина", "Что под капотом?",                        "22710");});
  server.on("/22710", [](){handleParts("Машина", "А батарейки менять надо?",                "63910");});
  server.on("/63910", [](){handleParts("Машина", "Странное место... Зато никто не сядет",   "49110");});
  server.on("/49110", [](){handleParts("Машина", "Би-би",                                   "89010");});
  server.on("/89010", [](){handleParts("Машина", "Там хранится платочек",                   "82710");});
  server.on("/82710", [](){handleParts("Машина", "Да места еще полно",                      "76610");});
  server.on("/76610", [](){handleMain("Вперед на отдых! Остались только виски...");});

  // Локация 11 Новая кухня
  server.on("/64311", [](){handleParts("Новая кухня", "Там видно тебя когда ты не там",           "40011");});
  server.on("/40011", [](){handleParts("Новая кухня", "Видно, что скоро его не будет",            "93211");});
  server.on("/93211", [](){handleParts("Новая кухня", "Все-таки широкая?",                        "78011");});
  server.on("/78011", [](){handleParts("Новая кухня", "В недра земли!",                           "46311");});
  server.on("/46311", [](){handleParts("Новая кухня", "Какая веранда красивая, и дождей нет",     "56111");});
  server.on("/56111", [](){handleParts("Новая кухня", "А эта труба зачем?",                       "34411");});
  server.on("/34411", [](){handleParts("Новая кухня", "Выше и выше, там же новое окно",           "66511");});
  server.on("/66511", [](){handleMain("Теперь все будет точно)");});

  // Локация-ловушка 12 кручусь верчусь: собрать номера с 7 крутилок
  // 61712 25212 55912 58512 28212 25312 34312 66012
  server.on("/61712", [](){handleLocation12("");});
  server.on("/25212", [](){handleLocation12("25212");});
  server.on("/55912", [](){handleLocation12("55912");});
  server.on("/58512", [](){handleLocation12("58512");});
  server.on("/28212", [](){handleLocation12("28212");});
  server.on("/25312", [](){handleLocation12("25312");});
  server.on("/34312", [](){handleLocation12("34312");});
  server.on("/66012", [](){handleLocation12("66012");});
  
  // Локация-ловушка 13 старая теплица: собрать номера 20 кусков теплицы
  // 92713 49413 40813 46213 89513 16613 29713 18613 52513 97013 91413 92813 20613 59713 44713 98513 42113 70613 56413 63313 34013 
  server.on("/92713", [](){handleLocation13("");});
  server.on("/49413", [](){handleLocation13("49413");});
  server.on("/40813", [](){handleLocation13("40813");});
  server.on("/46213", [](){handleLocation13("46213");});
  server.on("/89513", [](){handleLocation13("89513");});
  server.on("/16613", [](){handleLocation13("16613");});
  server.on("/29713", [](){handleLocation13("29713");});
  server.on("/18613", [](){handleLocation13("18613");});
  server.on("/52513", [](){handleLocation13("52513");});
  server.on("/97013", [](){handleLocation13("97013");});
  server.on("/91413", [](){handleLocation13("91413");});
  server.on("/92813", [](){handleLocation13("92813");});
  server.on("/20613", [](){handleLocation13("20613");});
  server.on("/59713", [](){handleLocation13("59713");});
  server.on("/44713", [](){handleLocation13("44713");});
  server.on("/98513", [](){handleLocation13("98513");});
  server.on("/42113", [](){handleLocation13("42113");});
  server.on("/70613", [](){handleLocation13("70613");});
  server.on("/56413", [](){handleLocation13("56413");});
  server.on("/63313", [](){handleLocation13("63313");});
  server.on("/34013", [](){handleLocation13("34013");});

  // Локация-ловушка 14 шланг: собрать номера с 4 шлангов по огороду
  // 17514 34714 68414 25614 87214 
  server.on("/17514", [](){handleLocation14("");});
  server.on("/34714", [](){handleLocation14("34714");});
  server.on("/68414", [](){handleLocation14("68414");});
  server.on("/25614", [](){handleLocation14("25614");});
  server.on("/87214", [](){handleLocation14("87214");});

  // Локация-ловушка 15 трубу не режь: секретное задание
  // 48615 64715
  server.on("/48615", [](){handleLocation15();});
  server.on("/64715", [](){handleMain("Хорошее задание? Давай лопать дальше!");});

  // Локация 16 отдых: просто отдохнуть
  server.on("/76716", [](){handleMain("Локация отдых: просто отдохнем чуть-чуть и можно дальше в бой!");});
}
